"talk-page-reply-button-accessibility-label" = "Ateb i %1$@";
"about-content-license-details-share-alike-license" = "Creative Commons Attribution-ShareAlike License";
"import-shared-reading-list-survey-prompt-button-cancel" = "Nes ymlaen";
"aaald-numerical-multiple-references-added-description" = "ychwanegwyd %1$d|0=0 references|%1$d reference|%1$d cyfeiriad";
"wikitext-downloading" = "Wrthi'n llwytho...";
"insert-media-image-size-setting-default" = "Rhagosodedig";
"aaald-characters-text-description" = "%1$d|0=nod|nod";
"insert-media-alternative-text-title" = "Testun amgen";
"about-content-license-details" = "Oni nodir yn wahanol, mae'r cynnwys o dan drwydded %1$@.";
"talk-page-share-button" = "Rhannu tudalen sgwrs";
"insert-media-image-position-setting-none" = "Dim";
"top-read-widget-title" = "Poblogaidd";
"diff-single-header-editor-number-edits-format" = "%1$d|%1$d golygiadau|%1$d golygiad|%1$d olygiad|%1$d golygiad";
"error-generic-recovery-suggestion" = "Ceisiwch eto yn nes ymlaen";
"places-search-your-current-location" = "Eich lleoliad cyfredol";
"action-add-to-reading-list-short" = "Ychwanegu at restr";
"talk-page-change-language" = "Newid iaith";
"unknown-generic-text" = "Anhysbys";
"panel-not-logged-in-title" = "Rydych chi heb fewngofnodi";
"account-creation-captcha-request-account" = "Gwneud gais am gyfrif.";
"wikitext-upload-captcha-error" = "Cafwyd nam wrth wiro'r CAPTCHA.";
"about-places-maps-license-details" = "Mae Lleoliadau yn defnyddio mapiau a darparwyd gan Apple Maps. %1$@.";
"aaald-new-journal-reference-title" = "Cyfnodolyn";
"history-clear-cancel" = "Canslo";
"project-name-wikimedia-commons" = "Comin Wikimedia";
"explore-most-read-more-list-title-for-date" = "Poblogaidd ar %1$@";
"theme-default-display-name" = "Rhagosodedig";
"welcome-exploration-explore-feed-title" = "Ffrwd Archwilio";
"description-welcome-descriptions-title" = "Disgrifiadau erthygl";
"search-recent-title" = "Chwiliadau diweddar";
"empty-no-search-results-message" = "Dim canlyniadau";
"about-repositories" = "Storfeydd";
"action-saved" = "Arbedwyd";
"field-alert-password-confirm-mismatch" = "Mae'r cyfrineiriau'n wahanol";
"insert-media-image-position-setting-center" = "Canol";
"login-forgot-password" = "Ydych chi wedi anghofio eich cyfrinair?";
"settings-my-languages" = "Fy ieithoedd";
"button-read-now" = "Darllen nawr";
"forgot-password-title" = "Ailosod cyfrinair";
"insert-action-title" = "Mewnosod";
"notifications-center-go-to-wikidata-item" = "Eitem Wicidata";
"table-of-contents-heading" = "Cynnwys";
"two-factor-login-with-regular-code" = "Defnyddio cod dilysu";
"wikitext-upload-save" = "Wrthi'n cyhoeddi...";
"wikitext-upload-save-sign-in" = "Mewngofnodi";
"article-share" = "Rhannu";
"about-translators-details" = "Cyfieithwyd gan wirfoddolwyr ar %1$@";
"history-title" = "Hanes";
"aaald-new-journal-reference-database" = "via %1$@";
"diff-single-header-summary-heading" = "Crynodeb golygu";
"about-libraries-complete-list" = "Rhestr lawn";
"number-millions" = "%1$@M";
"share-message-format" = "\U201c%1$@\U201d %2$@";
"talk-page-discussion-read-accessibility-label" = "Wedi'i ddarllen";
"talk-page-find-in-page-button" = "Chwilio yn y dudalen";
"edit-direction-left-accessibility-label" = "Symud cyrchwr i'r chwith";
"explore-most-read-generic-heading" = "Poblogaidd";
"action-replace-all" = "Disodli'r cyfan";
"featured-widget-title" = "Erthygl ddethol";
"wikitext-preview-link-preview-description" = "Mae'r ddolen hon yn arwain at '%1$@'";
"two-factor-login-title" = "Mewngofnodwch i'ch cyfri";
"notifications-center-mark-all-as-read" = "Marcio fel wedi'i ddarllen";
"aaald-article-description-updated-description" = "Wedi diweddaru disgrifiad yr erthygl";
"edit-notices-please-read" = "Darllenwch hwn cyn golygu";
"notifications-center-alert" = "Rhybudd";
"project-name-mediawiki" = "MediaWici";
"find-infolabel-number-matches" = "%1$@ / %2$@";
"notifications-center-mark" = "Marcio";
"share-get-directions-in-maps" = "Cael Cyfeiriadau";
"aaald-article-insert-new-changes" = "Newidiadau newydd";
"button-next" = "Nesaf";
"data-migration-status" = "Wrthi'n diweddaru...";
"explore-feed-preferences-feed-card-visibility-all-languages-off" = "Na";
"account-creation-log-in" = "Mewngofnodi";
"on-this-day-title" = "Ar y dydd hwn";
"aaald-error-subitle" = "Adfywio i geisio eto";
"insert-media-image-type-setting-frame" = "Ffr\U00e2m";
"notifications-center-agent-description-from-format" = "Gan %1$@";
"notifications-center-filters-read-status-section-title" = "Statws darllen";
"field-password-placeholder" = "Rhowch gyfrinair";
"settings-clear-cache-cancel" = "Canslo";
"share-social-mention-format" = "\U201c%1$@\U201d trwy Wicipedia: %2$@";
"places-accessibility-show-more" = "Dangos mwy o erthyglau";
"notifications-center-onboarding-modal-continue-action" = "Parhau";
"vanish-account-email-text" = "Helo,\nRwy'n gwneud cais i atal fy nghyfrif Wicipedia.";
"home-title" = "Archwilio";
"wikitext-preview-save-changes-title" = "Cadw newidiadau";
"edit-summary-add-summary-text" = "Rhoi crynodeb golygu";
"talk-page-error-alert-title" = "Gwall anhysbys";
"talk-page-replies-count-accessibilty-label" = "%1$d|%1$d ateb";
"insert-media-image-type-setting-basic" = "Sylfaenol";
"field-new-password-placeholder" = "Rhowch gyfrinair newydd";
"import-shared-reading-list-default-title" = "Fy rhestr ddarllen";
"field-new-password-confirm-title" = "Cadarnhau'r Cyfrinair";
"diff-thanks-sent" = "Rydych chi wedi dweud 'Diolch' i %1$@";
"notifications-center-mark-as-unread" = "Marcio fel heb ei ddarllen";
"notifications-center-status-all-notifications" = "Pob hysbysiad";
"edit-link-title" = "Golygu dolen";
"talk-page-new-subject-textfield-accessibility-label" = "Pwnc";
"notifications-center-onboarding-panel-secondary-button" = "Dim diolch";
"talk-page-link-user-action-sheet-title" = "Tudalen defnyddiwr";
"edit-link-display-text-title" = "Testun i'w arddangos";
"page-history-revision-history-title" = "Hanes golygu";
"main-menu-nearby" = "Gerllaw";
"forgot-password-email-sent" = "danfonwyd ebost gyda chyfarwyddiadau ail-osod cyfrinair atoch";
"field-username-placeholder" = "Rhowch enw defnyddiwr";
"talk-page-reply-title" = "Ateb";
"action-remove" = "Dileu";
"insert-media-image-type-settings-title" = "Math y ddelwedd";
"about-testers-details" = "Wedi arbrofi gan %1$@";
"project-name-wikibooks" = "Wicilyfrau";
"action-retry" = "Ail-geisio";
"relative-date-seconds-ago-abbreviated" = "%1$ds yn \U00f4l";
"settings-notifications-push-notifications" = "Hysbysiadau byw";
"notifications-center-swipe-mark-as-read" = "Marcio fel wedi'i ddarllen";
"account-creation-have-account" = "Oes gen ti gyfrif? %1$@";
"about-places-maps-license" = "Trwydded mapiau Lleoliadau";
"widget-onthisday-placeholder-article-snippet" = "Gwyddoniadur rhydd ar-lein y gall unrhyw un olygu";
"edit-direction-down-accessibility-label" = "Symud cyrchwr i lawr";
"notifications-center-empty-checking-for-notifications" = "Wrthi'n chwilio am hysbysiadau...";
"aaald-new-journal-reference-volume" = "Cyfrol %1$@:";
"table-of-contents-close-accessibility-hint" = "Cau";
"edit-reference-remove-accessibility-label" = "Dileu cystrawen cyfeirio";
"about-content-license" = "Trwydded y cynnwys";
"diff-paragraph-moved-format" = "Symudwyd y paragraff %1$@ %2$@";
"add-articles-to-reading-list" = "Ychwanegu %1$d|%1$d erthygl at restr ddarllen";
"notifications-center-filters-title" = "Hidlyddion";
"insert-media-image-type-setting-thumbnail" = "Bawdlun";
"action-read" = "Darllen";
"description-edit-learn-more" = "Dysgu mwy";
"edit-notices" = "Hysbysiadau golygu";
"about-places-maps-license-details-link-text" = "Gweler manylion y trwydded yma";
"table-of-contents-close-accessibility-label" = "Cau'r Tabl cynnwys";
"button-go-back" = "N\U00f4l";
"vanish-account-button-text" = "Gwneud cais";
"aaald-added-text-description-2" = "%1$@ wedi'u hychwanegu";
"aaald-many-sections-description" = "mewn %1$d adran";
"edit-summary-choice-fixed-typos" = "Trwsiwyd rhai gwallau teipio";
"description-published-button-title" = "Iawn";
"explore-featured-article-sub-heading-from-language-wikipedia" = "Wicipedia %1$@";
"welcome-languages-add-or-edit-button" = "Ychwanegu neu olygu hoff ieithoedd";
"reading-list-create-new-list-reading-list-name" = "Enw'r restr ddarllen";
"vanish-account-username-field" = "Enw defnyddiwr a thudalen defnyddiwr";
"settings-language-bar" = "Dangos yr ieithoedd wrth chwilio";
"field-password-confirm-title" = "Cadarnhau'r Cyfrinair";
"explore-feed-customize-accessibility-title" = "Addasu";
"talk-page-topic-close-button-hint" = "Cau pwnc newydd";
"main-menu-rate-app" = "Rhoi sg\U00f4r am yr ap";
"welcome-exploration-places-title" = "Tab Lleoliadau";
"account-creation-captcha-title" = "Gwiriad diogelwch CAPTCHA";
"insert-media-caption-title" = "Pennawd";
"aaald-new-talk-topic-description-format" = "%1$@ am yr erthygl";
"explore-nearby-heading" = "Llefydd gerllaw";
"description-help-tips-title" = "Cyngor ar ysgrifennu disgrifiadau";
"action-update" = "Diweddaru";
"project-name-wikivoyage" = "Wicidaith";
"explore-feed-preferences-feed-card-visibility-global-cards-on" = "Ie";
"talk-page-read-in-web" = "Darllen yn y porwr";
"nearby-distance-label-miles" = "%1$@ milltir";
"insert-link-title" = "Mewnosod dolen";
"additional-information-email-title" = "Gwybodaeth ychwanegol";
"field-username-title" = "Enw Defnyddiwr";
"edit-signature-remove-accessibility-label" = "Dileu cystrawen llofnod";
"notifications-center-status-double-concatenation" = "%1$@ yn %2$@";
"search-recent-clear-delete-all" = "Dileu'r cyfan";
"page-history-user-edits" = "golygiad gan ddefnyddwyr";
"about-title" = "Ynghylch";
"login-no-account" = "Dim cyfrif gennych? %1$@.";
"welcome-volunteer-send-usage-reports" = "Creu adroddiadau defnydd";
"on-this-day-detail-header-date-range" = "o %1$@ - %2$@";
"action-redo" = "Ail-wneud";
"diff-thanks-sent-cannot-unsend" = "Ni ellir wrthdroi 'Diolch'.";
"relative-date-hours-ago-abbreviated" = "%1$d awr yn \U00f4l";
"description-welcome-concise-title" = "Cadwch hi'n fyr";
"appearance-settings-theme-options" = "Opsiynau thema";
"edit-style-table-view-title" = "Arddull";
"notifications-center-filters-read-status-item-title-all" = "Popeth";
"announcements-dismiss" = "Cau";
"diff-single-header-editor-title" = "Gwybodaeth am y golygydd";
"explore-feed-preferences-card-hidden-title" = "Cuddiwyd y cerdyn";
"places-filter-articles-action-sheet-title" = "Hidlo erthyglau";
"aaald-deleted-text-description-2" = "%1$@ wedi'u dileu";
"edit-summary-placeholder-text" = "Sut wnaethoch chi wella'r erthygl?";
"talk-pages-user-logs" = "Logiau";
"edit-link-remove-link-title" = "Dileu'r ddolen";
"notifications-center-type-item-description-notice" = "Rhybudd";
"notifications-center-type-item-description-welcome-verbose" = "Neges groeso";
"account-group-title" = "Eich Cyfrif";
"action-unsave" = "Dad-gadw";
"button-skip" = "Anwybyddu";
"explore-feed-preferences-feed-cards-hidden-title" = "We%1$@di cuddio pob cerdyn %1$@";
"wikitext-preview-link-external-preview-title" = "Dolen allanol";
"action-language-accessibility" = "Newid iaith";
"more-languages-tooltip-title" = "Ychwanegu ieithoedd";
"diff-thanks-anonymous-no-thanks" = "Ni ellir diolch defnyddwyr dienw";
"diff-single-line-format" = "Llinell %1$d";
"app-store-subtitle" = "Y gwyddoniadur rhydd";
"notifications-center-swipe-more" = "Mwy";
"notifications-center-go-to-article-talk-format" = "Tudalen sgwrs %1$@";
"main-menu-account-logout" = "Allgofnodi";
"description-help-about-title" = "Ynghylch";
"about-testers" = "Profwyr";
"talk-pages-topic-reply-onboarding-body-note-ios15" = "Byddwch yn gyfeillgar, rydyn ni gyd yn bobl go iawn.";
"theme-black-display-name" = "Du";
"featured-widget-from-language-wikipedia" = "Wicipedia %1$@";
"field-password-confirm-placeholder" = "rhowch eich cyfrinair eto";
"aaald-article-insert-last-updated" = "Golygwyd ddiwethaf";
"explore-nearby-placeholder-heading" = "Lleoedd";
"about-libraries-licenses-title" = "Mae meddalwedd cod agored yn wych %1$@";
"vanish-account-additional-information-placeholder" = "Dewisol";
"welcome-send-data-learn-more" = "Dysgu mwy am gasglu data";
"about-repositories-app-source-license-mit" = "Trwydded MIT";
"notifications-center-filters-read-status-item-title-read" = "Wedi'i ddarllen";
"talk-pages-empty-view-header-user" = "Dechrau sgwrs gyda %1$@";
"field-token-title" = "Cod dilysu";
"vanish-account-title" = "Proses diflannu";
"welcome-explore-tell-me-more-done-button" = "Iawn";
"diff-multi-line-format" = "Llinellau %1$d - %2$d";
"search-field-placeholder-text" = "Chwilio ar Wicipedia";
"vanish-account-learn-more-text" = "Dysgu mwy";
"project-name-wikiversity" = "Wiciysgol";
"forgot-password-username-or-email-title" = "Neu";
"languages-wikipedia" = "Ieithoedd Wicipedia";
"account-creation-title" = "Creu cyfrif newydd";
"main-menu-privacy-policy" = "Polisi preifatrwydd";
"diff-compare-header-to-info-heading" = "I:";
"article-delete" = "Dileu";
"main-menu-about" = "Am yr ap";
"page-history-revision-comment-accessibility-label" = "Sylw %1$@";
"account-creation-saving" = "Wrthi'n cadw...";
"field-new-password-title" = "Cyfrinair newydd";
"notifications-center-notifications-settings" = "Gosodiadau hysbysiadau";
"notifications-center-status-read" = "Wedi'i ddarllen";
"reading-lists-default-list-title" = "Cadwyd";
"search-did-you-mean" = "Oeddech chi'n golygu %1$@?";
"table-of-contents-button-label" = "Tabl cynnwys";
"talk-page-subscribed-alert-title" = "Rydych chi wedi tanysgrifio!";
"talk-page-title-user-talk" = "Sgwrs Defnyddiwr";
"vanish-account-warning-title" = "Rhybudd";
"action-move-to-reading-list" = "Symud i restr ddarllen";
"notifications-center-change-password" = "Newid cyfrinair";
"explore-nearby-sub-heading-your-location" = "Eich lleoliad";
"about-product-of" = "Cr\U00ebwyd gan %1$@ gyda help gwirfoddolwyr fel chi";
"search-result-redirected-from" = "Ailgyfeiriwyd o: %1$@";
"icon-shortcut-nearby-title" = "Erthyglau gerllaw";
"history-clear-all" = "Clirio";
"account-talk-preferences-title" = "Dewisiadau tudalen sgwrs";
"saved-title" = "Arbedwyd";
"field-captcha-title" = "Teipiwch y testun a welwch uchod";
"reading-themes-controls-accessibility-dark-theme-button" = "Thema dywyll";
"settings-title" = "Gosodiadau";
"talk-pages-view-title" = "Sgwrs";
"settings-notifications-system-turn-on" = "Galluogi Hysbysiadau";
"notifications-center-empty-no-messages" = "Dim negeseuon";
"edit-minor-text" = "Golygiad bychan yw hwn";
"talk-page-menu-open-all" = "Agor pob edefyn";
"button-save-for-later" = "Cadw ar gyfer nes ymlaen";
"notifications-center-header-alert-from-agent" = "Rhybudd o %1$@";
"aaald-multiple-changes-description" = "Wedi gwneud nifer o newidiadau";
"description-help-tips-example-title-two" = "Mynydd uchaf y Ddaear";
"edit-summary-learn-more-text" = "Dysgu mwy";
"account-creation-logging-in" = "Wrthi'n mewngofnodi...";
"action-move-to" = "Symud i\U2026";
"insert-media-media-settings-title" = "Gosodiadau cyfryngau";
"article-languages-filter-placeholder" = "Chwilio am iaith";
"notifications-center-status-all" = "Popeth";
"talk-page-subscribe-to-topic" = "Tanysgrifio";
"talk-page-topic-title" = "Sgwrs";
"welcome-notifications-tell-me-more-title" = "Mwy am hysbysiadau";
"icon-shortcut-search-title" = "Chwilio Wicipedia";
"field-email-title" = "Cyfeiriad e-bost";
"aaald-single-reference-added-description" = "Ychwanegwyd y cyfeiriad";
"talk-pages-topic-compose-title-placeholder" = "Teitl y pwnc";
"main-menu-title" = "Mwy";
"notifications-center-onboarding-modal-learn-more-action" = "Dysgwch fwy am hysbysiadau";
"notifications-center-language-project-name-format" = "%2$@ %1$@";
"project-name-wikidata" = "Wicidata";
"relative-date-hours-abbreviated" = "%1$d awr";
"page-similar-titles" = "Tudalennau tebyg";
"notifications-center-destination-web" = "Yn y porwr";
"languages-title" = "Newid iaith";
"aaald-new-book-reference-title" = "Llyfr";
"notifications-center-cell-notification-type-accessibility-label-format" = "Hysbysiad %1$@";
"theme-dark-display-name" = "Tywyll";
"logged-out-log-back-in-button-title" = "Mewngofnodi i'ch cyfrif";
"settings-notifications-trending" = "Pynciau llosg";
"empty-no-article-message" = "Mae'n ddrwg gennym, ni ellir llwytho'r erthygl";
"edit-summary-choice-linked-words" = "Ychwanegwyd dolenni";
"number-thousands" = "%1$@K";
"insert-media-title" = "Mewnosod cyfryngau";
"aaald-one-section-description" = "yn yr adran %1$@";
"action-share-accessibility" = "Rhannu";
"places-search-top-articles-that-match-scope" = "Gerllaw";
"aaald-error-title" = "Methwyd a llwytho hanes yr erthygl";
"talk-page-archives" = "Archifau";
"talk-pages-empty-view-button-article-add-topic" = "Ychwanegu pwnc newydd";
"close-button-accessibility-label" = "Cau";
"theme-default-explanation" = "Defnyddio thema'r system";
"no-internet-connection" = "Dim cysylltiad gwe";
"notifications-center-swipe-mark-as-unread" = "Marcio fel heb ei ddarllen";
"page-protected-can-not-edit-title" = "Mae'r dudalen hon wedi'i gwarchod";
"project-name-wikispecies" = "Wicirywogaeth";
"login-title" = "Mewngofnodwch i'ch cyfri";
"diff-thanks-sent-already" = "Rydych chi eisoes wedi dweud 'Diolch' am y golygiad hwn";
"talk-pages-reply-button-title" = "Ateb i'r sgwrs hwn";
"notifications-center-inbox-title" = "Prosiectau";
"home-themes-action-title" = "Rheoli dewisiadau";
"theme-light-display-name" = "Golau";
"widget-onthisday-placeholder-event-snippet" = "Mae Wicipedia, y gwyddoniadur rhydd, yn mynd ar-lein.";
"main-menu-account-title-logged-in" = "Mewngofnodwyd fel %1$@";
"explore-featured-article-heading" = "Erthyglau dethol";
"explore-random-article-sub-heading-from-wikipedia" = "Wicipedia";
"wikitext-upload-save-terms-name" = "Telerau Defnyddio";
"theme-sepia-display-name" = "Sepia";
"aaald-multiple-references-added-description" = "Ychwanegwyd sawl cyfeiriad";
"top-read-widget-readers-count" = "%1$@ o ddarllenwyr";
"languages-settings-title" = "Ieithoedd";
"editing-welcome-citations-title" = "Dyfynnu ffynonnellau dibynadwy";
"description-help-more-info-title" = "Mwy o wybodaeth";
"notifications-center-onboarding-modal-title" = "Hysbysiadau golygu";
"diff-thanks-send-title" = "Dweud 'Diolch' yn gyhoeddus";
"notifications-center-subheader-thanks" = "Diolch";
"places-search-default-text" = "Chwilio Lleoedd";
"notifications-center-type-title-thanks" = "Diolch";
"search-recent-clear-confirmation-sub-heading" = "Ni ellir dadwneud y weithred hon!";
"two-factor-login-with-backup-code" = "Defnyddio cod wrth gefn";
"edit-link-link-target-title" = "Targed y ddolen";
"explore-nearby-placeholder-sub-heading-on-wikipedia" = "Gan Wicipedia";
"action-add-to-reading-list" = "Ychwanegu at eich rhestr ddarllen";
"aaald-article-insert-header" = "Diweddariadau Sylweddol";
"insert-media-image-type-setting-frameless" = "Di-ffr\U00e2m";
"diff-thanks-login-subtitle" = "Gallwch ddweud 'Diolch' i werthfawrogi gwaith golygydd arall ar Wicipedia. Rhaid ichi fewngofnodi i ddweud 'Diolch'.";
"home-news-footer" = "Mwy o faterion cyfoes";
"description-edit-length-warning" = "%1$@ / %2$@";
"edit-signature-accessibility-label" = "Ychwanegu cystrawen llofnod";
"login-join-wikipedia" = "Ymuno \U00e2 Wicipedia.";
"notifications-center-more-action-accessibility-label" = "Rhagor";
"logged-out-continue-without-logging-in-button-title" = "Parhau heb fewngofnodi";
"empty-insert-media-title" = "Dewiswch ffeil o Gomin Wicimedia";
"page-history-revision-minor-edit-accessibility-label" = "Golygiad bychan";
"description-welcome-start-editing-button" = "Dechrau golygu";
"add-citation-title" = "Ychwanegu cyfeiriad";
"action-sort" = "Trefnu";
"relative-date-minutes-ago-abbreviated" = "%1$dm yn \U00f4l";
"insert-media-image-size-settings-title" = "Maint y ddelwedd";
"talk-page-collapse-thread-button" = "Crebachu edefyn";
"about-wikipedia" = "Wicipedia";
"welcome-languages-description" = "Rydyn ni wedi canfod yr ieithoedd canlynol ar eich ddyfais:";
"settings-primary-language" = "Cynradd";
"explore-nearby-placeholder-sub-heading-on-language-wikipedia" = "Ar Wicipedia %1$@";
"action-add-to" = "Ychwanegu at\U2026";
"main-menu-account-login" = "Mewngofnodi";
"edit-published" = "Wedi cyhoeddi'r golygiad";
"empty-no-other-article-languages-title" = "Dim ieithoedd eraill ar gael";
"reading-list-create-new-list-title" = "Creu rhestr newydd";
"action-next-revision-accessibility" = "Golygiad Nesaf";
"explore-feed-preferences-feed-card-visibility-all-languages-on" = "Ie am bopeth";
"explore-randomizer" = "Hapiwr";
"back-button-accessibility-label" = "Yn \U00f4l";
"talk-page-revision-history" = "Hanes golygu";
"action-previous-revision-accessibility" = "Golygiad Blaenorol";
"appearance-settings-reading-themes" = "Them\U00e2u darllen";
"notifications-center-filters-read-status-item-title-unread" = "Heb ei ddarllen";
"notifications-center-type-title-welcome" = "Croeso";
"talk-page-reply-placeholder-format" = "Ateb i %1$@";
"edit-text-size-table-view-title" = "Maint testun";
"notifications-center-status-filtered-by" = "Hidlwyd gan";
"description-edit-pencil-title" = "Golygu disgrifiad yr erthygl";
"nearby-distance-label-km" = "%1$@ km";
"search-button-accessibility-label" = "Chwilio Wicipedia";
"diff-context-lines-collapsed-button-title" = "Dangos";
"wikitext-preview-link-not-found-preview-title" = "Dim dolen mewnol";
"main-menu-account-logout-are-you-sure" = "Ydych chi'n sicr eich bod am allgofnodi?";
"explore-continue-reading-heading" = "Parhau i ddarllen";
"home-more-like-footer" = "Mwy fel %1$@";
"image-gallery-unknown-owner" = "Awdur anhysbys.";
"diff-paragraph-moved-distance-section" = "%1$d|%1$d adran";
"button-report-a-bug" = "Riportio nam";
"table-of-contents-subheading-label" = "Is-bennawd %1$d";
"saved-all-articles-title" = "Pob erthygl";
"new-password-title" = "Gosodwch eich cyfrinair";
"notifications-center-go-to-article" = "Erthygl";
"menu-cancel-accessibility-label" = "Canslo";
"talk-page-related-links" = "Beth sy'n cysylltu yma";
"wikitext-preview-link-preview-title" = "Rhagolwg dolen";
"button-publish" = "Cyhoeddi";
"talk-page-error-loading-subtitle" = "Digwyddodd gwall";
"diff-context-lines-expanded-button-title" = "Cuddio";
"navbar-title-mode-edit-wikitext-preview" = "Rhagolwg";
"welcome-languages-add-button" = "Ychwanegu iaith arall";
"page-history-revision-author-accessibility-label" = "Awdur: %1$@";
"field-password-title" = "Cyfrinair";
"aaald-article-insert-read-more" = "Darllen diweddariadau eraill";
"import-shared-reading-list-survey-prompt-button-take-survey" = "Cymryd yr arolwg";
"explore-random-article-sub-heading-from-language-wikipedia" = "Wicipedia %1$@";
"notifications-center-subheader-email-from-other-user" = "E-bost newydd";
"welcome-intro-free-encyclopedia-more" = "Dysgwch fwy am Wicipedia";
"description-edit-publish" = "Cyhoeddi disgrifiad";
"talk-page-error-loading-title" = "Ni ellir llwytho tudalen sgwrs";
"two-factor-login-continue" = "Parhau i fewngofnodi";
"action-discard-edits" = "Canslo golygiadau";
"talk-page-expand-thread-button" = "Agor edefyn";
"cc-zero" = "Creative Commons CC0";
"insert-media-image-size-setting-custom" = "Cyfaddas";
"talk-pages-coffee-roll-read-more" = "Darllen mwy";
"icon-shortcut-random-title" = "Erthygl ar hap";
"notifications-center-onboarding-modal-push-notifications-title" = "Hysbysiadau byw";
"action-find-in-page" = "Chwilio'r testun";
"button-ok" = "Iawn";
"notifications-center-destination-app" = "Mewnol";
"aaald-vandalism-revert-description" = "wedi gwrthdroi fandaliaeth";
"account-creation-captcha-obtaining" = "Wrthi'n n\U00f4l CAPTCHA newydd...";
"explore-hide-card-prompt" = "Cuddio'r cerdyn hwn";
"logged-out-title" = "Rydych chi wedi allgofnodi";
"about-repositories-app-source-license" = "Cod ffynhonnell ar gael o dan y %1$@.";
"diff-paragraph-moved-direction-up" = "i fyny";
"dim-images" = "Tywyllu delweddau";
"about-libraries" = "Llyfrgelloedd a ddefnyddiwyd";
"edit-text-clear-formatting" = "Clirio fformatiau";
"main-menu-zero-faq" = "Cwestiynau Cyffredin Wicipedia Sero";
"notifications-center-type-title-other" = "Arall";
"panel-compare-revisions-title" = "Cymharu golygiadau";
"explore-main-page-heading" = "Heddiw ar Wicipedia";
"aaald-view-full-history-button" = "Edrych ar hanes lawn yr erthygl";
"diff-compare-header-from-info-heading" = "O:";
"vanish-account-continue-button-title" = "Parhau";
"account-request-vanishing" = "Gorchuddio cyfrif";
"diff-thanks-login-title" = "Mewngofnodi i ddweud 'Diolch'";
"insert-media-image-preview-more-information-action-title" = "Rhagor o wybodaeth";
"action-share" = "Rhannu";
"places-filter-button-title" = "Hidlo";
"nearby-distance-label-meters" = "%1$@ m";
"table-of-contents-hide-button-label" = "Cuddio'r tabl cynnwys";
"home-nearby-location-footer" = "Mwy gerllaw %1$@";
"talk-page-new-topic-title" = "Sgwrs newydd";
"talk-page-reply-button" = "Ateb";
"talk-pages-empty-view-button-user-start-discussion" = "Dechrau trafodaeth newydd";
"explore-because-you-read" = "Rydych chi wedi darllen";
"action-save" = "Cadw";
"cancel" = "Canslo";
"insert-media-image-size-settings-px-unit-name" = "px";
"potd-widget-title" = "Delwedd y dydd";
"talk-pages-topic-compose-body-placeholder-accessibility" = "Disgrifiad y pwnc";
"edit-text-formatting-table-view-title" = "Fformatio testun";
"description-add-title" = "Ychwanegu disgrifiad";
"notifications-center-go-to-your-talk-page" = "Eich tudalen sgwrs";
"description-edit-for-article" = "Disgrifiad erthygl am %1$@";
"editing-welcome-impartial-tone-title" = "Ysgrifennwch yn ddiduedd";
"talk-page-user-contributions" = "Cyfraniadau";
"appearance-settings-expand-tables" = "Ehangu tablau";
"project-name-wikinews" = "Wicinewyddion";
"notifications-center-checking-for-notifications" = "Wrthi'n chwilio am hysbysiadau...";
"about-translators" = "Cyfieithwyr";
"relative-date-hours-ago" = "%1$d|0=Yn ddiweddar|%1$d awr yn \U00f4l";
"explore-feed-preferences-explore-tab" = "Tab Archwilio";
"settings-notifications" = "Hysbysiadau byw";
"description-help-about-wikidata" = "Yngl\U0177n \U00e2 Wicidata";
"explore-most-read-sub-heading-on-language-wikipedia" = "Ar Wicipedia %1$@";
"notifications-center-title" = "Hysbysiadau";
"description-edit-placeholder-title" = "Disgrifiadau byr sydd orau";
"more-languages-tooltip-description" = "Chwilio Wicipedia mewn dros 300 o ieithoedd";
"reading-themes-controls-accessibility-black-theme-button" = "Thema du";
"edit-direction-right-accessibility-label" = "Symud cyrchwr i'r dde";
"share-social-format" = "\U201c%1$@\U201d trwy Wicipedia: %2$@";
"talk-page-unsubscribe-to-topic" = "Dad-danysgrifio";
"project-name-wikiquote" = "Wiciddyfynnu";
"field-alert-username-unavailable" = "Nid yw'r  enw-defnyddiwr yma ar gael";
"page-history-bot-edits" = "Golygiadau gan fot";
"description-edit-pencil-introduction" = "Golygu'r cyflwyniad";
"places-enable-location-action-button-title" = "Galluogi lleoliad";
"reading-list-create-new-list-button-title" = "Creu rhestr ddarllen";
"notifications-center-login-notifications" = "Hysbysiadau mewngofnodi";
"app-store-keywords" = "Wicipedia, cyfeirio, wici, gwyddoniadur, gwybodaeth, ymchwil, archwilio, dysgu";
"field-captcha-placeholder" = "Testun CAPTCHA";
"places-search-did-you-mean" = "Oeddech chi'n golygu %1$@?";
"about-libraries-license" = "Trwydded";
"forgot-password-instructions" = "Llenwch un o'r meysydd isod er mwyn i chi dderbyn cyfarwyddiadau sut i ailosod eich cyfrinair drwy ebost";
"talk-pages-topic-compose-body-placeholder" = "Disgrifiad";
"talk-pages-topic-compose-navbar-title" = "Pwnc";
"search-recent-clear-confirmation-heading" = "Dileu'r holl chwiliadau?";
"talk-pages-topic-reply-onboarding-title" = "Tudalennau sgwrs";
"explore-feed-preferences-hide-card-action-title" = "Cuddio'r cerdyn hwn";
"notifications-center-go-to-diff" = "Gwahan";
"notifications-center-subheader-welcome" = "Croeso!";
"article-languages-others" = "Ieithoedd eraill";
"search-recent-clear-cancel" = "Canslo";
"notifications-center-onboarding-modal-notifications-alerts-title" = "Hysbysiadau a rhybuddion";
"talk-page-discussion-accessibility-hint" = "Tapiwch ddwywaith i agor edefyn sgwrs";
"page-issues" = "Problemau \U00e2'r dudalen";
"description-help-title" = "Cymorth disgrifiadau erthygl";
"notifications-center-go-to-talk-page" = "Tudalen sgwrs";
"article-about-title" = "Yngl\U0177n \U00e2'r erthygl hon";
"find-textfield-accessibility" = "Chwilio";
"explore-most-read-sub-heading-on-wikipedia" = "Ar Wicipedia";
"field-email-placeholder" = "enghraifft@enghraifft.org";
"notifications-center-onboarding-modal-filters-title" = "Hidlyddion";
"settings-notifications-echo-failure-try-again" = "Ceisiwch eto";
"project-name-wikisource" = "Wicidestun";
"diff-single-intro-title" = "Agoriad";
"talk-page-add-discussion-accessibility-label" = "Ychwanegu sgwrs";
"talk-pages-empty-view-header-article" = "Mae'r sgwrs yn dechrau yma";
"diff-paragraph-moved-distance-line" = "%1$d|%1$d llinell|%1$d llinell|%1$d linell|%1$d llinell";
"article-languages-label" = "Dewisiwch iaith";
"nearby-distance-label-feet" = "%1$@ troedfedd";
"about-wikimedia-foundation" = "Sefydliad Wicimedia";
"notifications-center-inbox-wikimedia-projects-section-title" = "Prosiectau Wicimedia";
"aaald-new-news-reference-title" = "Newyddion";
"talk-page-discussion-unread-accessibility-label" = "Heb ei ddarllen";
"unable-to-load-talk-page-title" = "Ni ellir llwytho tudalen sgwrs";
"explore-potd-sub-heading" = "Comin Wikimedia";
"article-reference-view-title" = "Cyfeiriad %1$@";
"back-button-popover-title" = "Tapiwch i fynd yn \U00f4l";
"welcome-intro-free-encyclopedia-more-about" = "Yngl\U0177n \U00e2 Wicipedia";
"aaald-new-news-reference-retrieved-date" = "Adalwyd %1$@";
"talk-page-new-subject-placeholder-text" = "Pwnc";
"edit-watch-this-page-text" = "Gwylio'r dudalen hon";
"vanish-account-back-confirm-keep-editing" = "Parhau i olygu";
"on-this-day-sub-title-for-date-from-language-wikipedia" = "%1$@ o Wicipedia %2$@";
"explore-feed-preferences-in-the-news-description" = "Erthyglau am faterion cyfoes";
"talk-page-title-article-talk" = "Sgwrs Erthygl";
"description-help-tips-example-title-one" = "paentiad gan Leonardo Da Vinci";
"compass-direction" = "am %1$@ o'r gloch";
"diff-paragraph-moved" = "Symudwyd y paragraff";
"talk-page-page-info" = "Gwybodaeth am y dudalen";
"diff-paragraph-moved-direction-down" = "i lawr";
"explore-feed-preferences-global-cards-title" = "Cardiau cydwici";
"diff-thanks-send-subtitle" = "Gallwch ddweud 'Diolch' i werthfawrogi gwaith golygydd arall ar Wicipedia. Ni ellir wrthdroi 'Diolch' ac maen nhw'n weladwy i bawb.";
"places-title" = "Lleoedd";
"page-history-anonymous-edits" = "golygiadau gan ddefnyddwyr dienw";
"field-email-title-optional" = "Cyfeiriad e-bost (dewisol)";
"field-alert-token-invalid" = "Cod annilys";
"in-the-news-title" = "Ar y Newyddion";
"project-name-wiktionary" = "Wiciadur";
"notifications-center-filters-types-item-title-all" = "Pob math";
"reference-title" = "Cyfeiriad %1$@";
"welcome-intro-free-encyclopedia-title" = "Y gwyddoniadur rhydd";
"notifications-center-filters-types-section-title" = "Mathau o hysbysiadau";
"field-alert-captcha-invalid" = "Mae'r CAPTCHA yn anghywir";
"panel-not-logged-in-continue-edit-action-title" = "Golygu heb fewngofnodi";
"wikitext-upload-captcha-needed" = "Mae angen gwiro'r CAPTCHA.";
"welcome-exploration-on-this-day-title" = "Ar y dydd hwn";
"diff-thanks-send-button-title" = "Dweud 'Diolch'";
"welcome-send-data-helps-title" = "Helpwch wella'r ap";
"in-the-news-sub-title-from-language-wikipedia" = "Wicipedia %1$@";
"page-history-compare-title" = "Cymharu";
"insert-media-uploaded-image-title" = "Delwedd wedi'i huwchlwytho";
"clear-title-accessibility-label" = "Clirio";
"reading-list-limit-hit-for-unsorted-articles-button-title" = "Trefnu erthyglau";
"button-publish-anyway" = "Cyhoeddi sut bynnag";
"vanish-modal-title" = "Cais gorchuddio";
"field-backup-token-title" = "Cod wrth gefn";
"explore-feed-preferences-hide-feed-cards-action-title" = "Cuddio pob cerdyn \U201c%1$@\U201d";
"notifications-center-feed-news-notification-dismiss-button-text" = "Nes ymlaen";
"relative-date-days-ago" = "%1$d|0=Heddiw|1=Ddoe|%1$d diwrnod yn \U00f4l";
"reading-themes-controls-accessibility-light-theme-button" = "Thema golau";
"aaald-new-website-reference-archive-date-text" = "o'r %1$@ gwreiddiol";
"explore-featured-article-sub-heading-from-wikipedia" = "Ar Wicipedia";
"main-menu-account-logout-cancel" = "Canslo";
"in-the-news-sub-title-from-wikipedia" = "Wicipedia";
"welcome-languages-search-title" = "Chwilio mewn dros 300 iaith";
"aaald-revision-userInfo" = "Golygiad gan %1$@ (%2$@ edits)";
"edit-menu-item" = "Golygu";
"insert-media-image-position-setting-right" = "De";
"aaald-new-website-reference-title" = "Gwefan";
"aaald-summary-title" = "%1$d|0=0 newidiadau|%1$d newid gan %1$d|0=0 golygyddion|%2$d golygydd|%2$d olygydd|%2$d golygydd o fewn %3$d|0=0 diwrnodau|%3$d diwrnod|%3$d ddiwrnod|%3$d diwrnod";
"description-help-tips-for-example" = "Er enghraifft:";
"explore-most-read-footer" = "Pob erthygl poblogaidd";
"field-new-password-confirm-placeholder" = "Ail-deipiwch eich cyfrinair";
"action-replace" = "Disodli";
"article-languages-yours" = "Eich ieithoedd";
"history-clear-delete-all" = "Ie! Dileu'r cyfan!";
"notifications-center-mark-as-read" = "Marcio fel wedi'i ddarllen";
"account-talk-page-title" = "Eich tudalen sgwrs";
"reading-themes-controls-accessibility-sepia-theme-button" = "Thema sepia";
"sort-by-title-action" = "Teitl";
"talk-page-new-banner-title" = "Byddwch yn gyfeillgar";
"description-help-wikidata-guide" = "Canllaw Wicidata ar ysgrifennu disgrifiadau";
"notifications-center-num-selected-messages-format" = "%1$d|%1$d neges";
"explore-random-article-heading" = "Erthygl ar hap";
"aaald-two-sections-description" = "o fewn adran %1$@ a %2$@";
"page-location" = "Gweld ar fap";
"insert-media-alternative-text-placeholder" = "Disgrifiwch y ddelwedd hon";
"places-accessibility-show-as-list" = "Dangos fel rhestr";
"talk-page-permanent-link" = "Dolen barhaol";
"notifications-center-go-to-user-page" = "Tudalen defnyddiwr %1$@";
"settings-support" = "Cefnogwch Wicipedia";
"number-billions" = "%1$@B";
"export-user-data-title" = "Allforio Data Defnyddiwr";
"edit-summary-choice-fixed-grammar" = "Trwsiwyd y ramadeg";
"reading-list-create-new-list-description" = "Disgrifiad";
"search-clear-title" = "Clirio";
"talk-pages-topic-compose-close-confirmation-discard" = "Tynnu ateb";
"talk-pages-user-groups" = "Grwpiau defnyddiwr";
"article-read-more-title" = "Darllen mwy";
"explore-potd-heading" = "Delwedd y dydd";
"page-history-minor-edits" = "golygiadau bychain";
"aaald-small-change-description" = "%1$d|0=Dim newidiadau bychan|%1$d newid bychan|%1$d newid bychan";
"appearance-settings-set-automatic-table-opening" = "Gosodiadau Tabl";
"search-title" = "Chwilio";
"about-send-feedback" = "Rhoi adborth am yr ap";
"about-contributors" = "Cyfranwyr";
"variants-alert-dismiss-button" = "Dim diolch";
"diff-compare-header-heading" = "Cymharu Golygiadau";
"history-clear-confirmation-heading" = "Hollol sicr eich bod am ddileu'r cyfan?";
"insert-media-image-preview-select-image-action-title" = "Dewis delwedd";
"places-accessibility-show-as-map" = "Dangos ar fap";
"reading-list-name-user-created-annotation" = "_[cr\U00ebwyd gan ddefnyddiwr]";
"insert-media-image-position-settings-title" = "Lleoliad y ddelwedd";
"vanish-account-additional-information-field" = "Gwybodaeth pellach";
"talk-page-add-topic-button" = "Ychwanegu pwnc";
"edit-reference-accessibility-label" = "Ychwanegu cystrawen cyfeirio";
"share-open-in-maps" = "Agor yn Mapiau";
"notifications-center-status-unread" = "Heb ei ddarllen";
"main-menu-terms-of-use" = "Telerau Defnyddio";
"featured-widget-from-wikipedia" = "Wicipedia";
"explore-feed-preferences-feed-card-visibility-languages-count" = "Ar gael ar %1$d";
"aaald-revision-by-anonymous" = "Golygu gan ddefnyddiwr dienw";
"diff-revision-error-title" = "Ni ellir llwytho golygiad";
"forgot-password-button-title" = "Ailosod";
"share-on-twitter-sign-off" = "trwy Wicipedia";
"button-saved-for-later" = "Cadwyd";
"action-undo" = "Dadwneud";
"description-edit-title" = "Golygu disgrifiad";
"action-cancel" = "Canslo";
"talk-pages-compose-close-confirmation-keep" = "Parhau i olygu";
"notifications-center-inbox-wikipedias-section-title" = "Wicipediau";
"aaald-new-website-reference-archive-url-text" = "URL Archive.org";
"error-unknown" = "Digwyddodd gwall anhysbys";
"settings-help-and-feedback" = "Cymorth ac adborth";
"account-creation-create-account" = "Creu cyfrif";
"aaald-new-discussion" = "Sgwrs newydd";
"talk-pages-archives-view-title" = "Archifau";
"insert-media-image-position-setting-left" = "Chwith";
"main-menu-heading-legal" = "Telerau a phreifatrwydd";
"editing-welcome-be-bold-title" = "Dweud eich dweud";
"places-accessibility-group" = "%1$@ erthygl";
"welcome-explore-continue-button" = "Dechrau arni";
"talk-page-article-about" = "Yngl\U0177n \U00e2 thudalennau sgwrs";
"action-thank-user-accessibility" = "Diolch y defnyddiwr";
"diff-compare-title" = "Cymharu Golygiadau";
"vanish-account-back-confirm-discard" = "Tynnu Cais";
"welcome-explore-new-ways-title" = "Ffyrdd newydd i archwilio";
"edit-direction-up-accessibility-label" = "Symud cyrchwr i fyny";
